# Задача

У вас ответственное задание — нужно написать программу для авиакомпании, которая будет распределять пассажиров по местам
в самолёте. Чтобы не усложнять, будем считать, что места идут последовательно: 1, 2, 3, …, 50, 51, 52 и так далее.
Заполните хеш-таблицу таким образом, чтобы каждому пассажиру в ней соответствовало его место в самолёте.

Ожидаемый результат
```
Места пассажиров: {Людмила Ульянова=5, Игорь Серов=4, Аймурат Бериков=1, Азамат Бексултанов=3, Диана Азатова=2}
```

```java
import java.util.HashMap;
import java.util.List;
import java.util.Map;

public class Practice {
    // Пример списка пассажиров (на самом деле их больше)
    private static final List<String> passengerNames = List.of(
            "Аймурат Бериков",
            "Диана Азатова",
            "Азамат Бексултанов",
            "Игорь Серов",
            "Людмила Ульянова"
    );

    public static void main(String[] args) {
        Map<String, Integer> seats = assignSeats(passengerNames);
        System.out.println("Места пассажиров: " + seats);
    }

    public static Map<String, Integer> assignSeats(List<String> passengerNames) {
        // Тут нужно написать код, который будет распределять места в самолёте ✈️
    }
}
```